HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** \\brief  48C, Result Assignment Register, Group */
#define VADC_G0_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002048Cu)

/** Alias (User Manual Name) for VADC_G0_RRASS.
* To use register names with standard convension, please use VADC_G0_RRASS.
*/
#define	VADC_G0RRASS	(VADC_G0_RRASS)

/** \\brief  598, Source Event Flag Clear Register, Group */
#define VADC_G0_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0020598u)

/** Alias (User Manual Name) for VADC_G0_SEFCLR.
* To use register names with standard convension, please use VADC_G0_SEFCLR.
*/
#define	VADC_G0SEFCLR	(VADC_G0_SEFCLR)

/** \\brief  588, Source Event Flag Register, Group */
#define VADC_G0_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0020588u)

/** Alias (User Manual Name) for VADC_G0_SEFLAG.
* To use register names with standard convension, please use VADC_G0_SEFLAG.
*/
#define	VADC_G0SEFLAG	(VADC_G0_SEFLAG)

/** \\brief  5C0, Source Event Node Pointer Register, Group */
#define VADC_G0_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00205C0u)

/** Alias (User Manual Name) for VADC_G0_SEVNP.
* To use register names with standard convension, please use VADC_G0_SEVNP.
*/
#define	VADC_G0SEVNP	(VADC_G0_SEVNP)

/** \\brief  5C8, Service Request Software Activation Trigger, Group */
#define VADC_G0_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00205C8u)

/** Alias (User Manual Name) for VADC_G0_SRACT.
* To use register names with standard convension, please use VADC_G0_SRACT.
*/
#define	VADC_G0SRACT	(VADC_G0_SRACT)

/** \\brief  4C0, Synchronization Control Register, Group */
#define VADC_G0_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00204C0u)

/** Alias (User Manual Name) for VADC_G0_SYNCTR.
* To use register names with standard convension, please use VADC_G0_SYNCTR.
*/
#define	VADC_G0SYNCTR	(VADC_G0_SYNCTR)

/** \\brief  5F8, Valid Flag Register, Group */
#define VADC_G0_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00205F8u)

/** Alias (User Manual Name) for VADC_G0_VFR.
* To use register names with standard convension, please use VADC_G0_VFR.
*/
#define	VADC_G0VFR	(VADC_G0_VFR)

/** \\brief  2CB0, Alias Register, Group */
#define VADC_G10_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF0022CB0u)

/** Alias (User Manual Name) for VADC_G10_ALIAS.
* To use register names with standard convension, please use VADC_G10_ALIAS.
*/
#define	VADC_G10ALIAS	(VADC_G10_ALIAS)

/** \\brief  2C80, Arbitration Configuration Register, Group */
#define VADC_G10_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0022C80u)

/** Alias (User Manual Name) for VADC_G10_ARBCFG.
* To use register names with standard convension, please use VADC_G10_ARBCFG.
*/
#define	VADC_G10ARBCFG	(VADC_G10_ARBCFG)

/** \\brief  2C84, Arbitration Priority Register, Group */
#define VADC_G10_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0022C84u)

/** Alias (User Manual Name) for VADC_G10_ARBPR.
* To use register names with standard convension, please use VADC_G10_ARBPR.
*/
#define	VADC_G10ARBPR	(VADC_G10_ARBPR)

/** \\brief  2D20, Autoscan Source Control Register, Group */
#define VADC_G10_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0022D20u)

/** Alias (User Manual Name) for VADC_G10_ASCTRL.
* To use register names with standard convension, please use VADC_G10_ASCTRL.
*/
#define	VADC_G10ASCTRL	(VADC_G10_ASCTRL)

/** \\brief  2D24, Autoscan Source Mode Register, Group */
#define VADC_G10_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0022D24u)

/** Alias (User Manual Name) for VADC_G10_ASMR.
* To use register names with standard convension, please use VADC_G10_ASMR.
*/
#define	VADC_G10ASMR	(VADC_G10_ASMR)

/** \\brief  2D2C, Autoscan Source Pending Register, Group */
#define VADC_G10_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF0022D2Cu)

/** Alias (User Manual Name) for VADC_G10_ASPND.
* To use register names with standard convension, please use VADC_G10_ASPND.
*/
#define	VADC_G10ASPND	(VADC_G10_ASPND)

/** \\brief  2D28, Autoscan Source Channel Select Register, Group */
#define VADC_G10_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022D28u)

/** Alias (User Manual Name) for VADC_G10_ASSEL.
* To use register names with standard convension, please use VADC_G10_ASSEL.
*/
#define	VADC_G10ASSEL	(VADC_G10_ASSEL)

/** \\brief  2CC8, Boundary Flag Register, Group */
#define VADC_G10_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF0022CC8u)

/** Alias (User Manual Name) for VADC_G10_BFL.
* To use register names with standard convension, please use VADC_G10_BFL.
*/
#define	VADC_G10BFL	(VADC_G10_BFL)

/** \\brief  2CD0, Boundary Flag Control Register, Group */
#define VADC_G10_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF0022CD0u)

/** Alias (User Manual Name) for VADC_G10_BFLC.
* To use register names with standard convension, please use VADC_G10_BFLC.
*/
#define	VADC_G10BFLC	(VADC_G10_BFLC)

/** \\brief  2CD4, Boundary Flag Node Pointer Register, Group */
#define VADC_G10_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF0022CD4u)

/** Alias (User Manual Name) for VADC_G10_BFLNP.
* To use register names with standard convension, please use VADC_G10_BFLNP.
*/
#define	VADC_G10BFLNP	(VADC_G10_BFLNP)

/** \\brief  2CCC, Boundary Flag Software Register, Group */
#define VADC_G10_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF0022CCCu)

/** Alias (User Manual Name) for VADC_G10_BFLS.
* To use register names with standard convension, please use VADC_G10_BFLS.
*/
#define	VADC_G10BFLS	(VADC_G10_BFLS)

/** \\brief  2CB8, Boundary Select Register, Group */
#define VADC_G10_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF0022CB8u)

/** Alias (User Manual Name) for VADC_G10_BOUND.
* To use register names with standard convension, please use VADC_G10_BOUND.
*/
#define	VADC_G10BOUND	(VADC_G10_BOUND)

/** \\brief  2D90, Channel Event Flag Clear Register, Group */
#define VADC_G10_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022D90u)

/** Alias (User Manual Name) for VADC_G10_CEFCLR.
* To use register names with standard convension, please use VADC_G10_CEFCLR.
*/
#define	VADC_G10CEFCLR	(VADC_G10_CEFCLR)

/** \\brief  2D80, Channel Event Flag Register, Group */
#define VADC_G10_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022D80u)

