HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G10_CEFLAG.
* To use register names with standard convension, please use VADC_G10_CEFLAG.
*/
#define	VADC_G10CEFLAG	(VADC_G10_CEFLAG)

/** \\brief  2DA0, Channel Event Node Pointer Register 0, Group */
#define VADC_G10_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF0022DA0u)

/** Alias (User Manual Name) for VADC_G10_CEVNP0.
* To use register names with standard convension, please use VADC_G10_CEVNP0.
*/
#define	VADC_G10CEVNP0	(VADC_G10_CEVNP0)

/** \\brief  2C88, Channel Assignment Register, Group */
#define VADC_G10_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022C88u)

/** Alias (User Manual Name) for VADC_G10_CHASS.
* To use register names with standard convension, please use VADC_G10_CHASS.
*/
#define	VADC_G10CHASS	(VADC_G10_CHASS)

/** \\brief  2E00, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E00u)

/** Alias (User Manual Name) for VADC_G10_CHCTR0.
* To use register names with standard convension, please use VADC_G10_CHCTR0.
*/
#define	VADC_G10CHCTR0	(VADC_G10_CHCTR0)

/** \\brief  2E04, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E04u)

/** Alias (User Manual Name) for VADC_G10_CHCTR1.
* To use register names with standard convension, please use VADC_G10_CHCTR1.
*/
#define	VADC_G10CHCTR1	(VADC_G10_CHCTR1)







/** \\brief  2E08, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E08u)

/** Alias (User Manual Name) for VADC_G10_CHCTR2.
* To use register names with standard convension, please use VADC_G10_CHCTR2.
*/
#define	VADC_G10CHCTR2	(VADC_G10_CHCTR2)

/** \\brief  2E0C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E0Cu)

/** Alias (User Manual Name) for VADC_G10_CHCTR3.
* To use register names with standard convension, please use VADC_G10_CHCTR3.
*/
#define	VADC_G10CHCTR3	(VADC_G10_CHCTR3)

/** \\brief  2E10, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E10u)

/** Alias (User Manual Name) for VADC_G10_CHCTR4.
* To use register names with standard convension, please use VADC_G10_CHCTR4.
*/
#define	VADC_G10CHCTR4	(VADC_G10_CHCTR4)

/** \\brief  2E14, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E14u)

/** Alias (User Manual Name) for VADC_G10_CHCTR5.
* To use register names with standard convension, please use VADC_G10_CHCTR5.
*/
#define	VADC_G10CHCTR5	(VADC_G10_CHCTR5)

/** \\brief  2E18, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E18u)

/** Alias (User Manual Name) for VADC_G10_CHCTR6.
* To use register names with standard convension, please use VADC_G10_CHCTR6.
*/
#define	VADC_G10CHCTR6	(VADC_G10_CHCTR6)

/** \\brief  2E1C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E1Cu)

/** Alias (User Manual Name) for VADC_G10_CHCTR7.
* To use register names with standard convension, please use VADC_G10_CHCTR7.
*/
#define	VADC_G10CHCTR7	(VADC_G10_CHCTR7)



/** \\brief  2DF0, External Multiplexer Control Register, Group x */
#define VADC_G10_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF0022DF0u)

/** Alias (User Manual Name) for VADC_G10_EMUXCTR.
* To use register names with standard convension, please use VADC_G10_EMUXCTR.
*/
#define	VADC_G10EMUXCTR	(VADC_G10_EMUXCTR)

/** \\brief  2CA0, Input Class Register */
#define VADC_G10_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0022CA0u)

/** Alias (User Manual Name) for VADC_G10_ICLASS0.
* To use register names with standard convension, please use VADC_G10_ICLASS0.
*/
#define	VADC_G10ICLASS0	(VADC_G10_ICLASS0)

/** \\brief  2CA4, Input Class Register */
#define VADC_G10_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0022CA4u)

/** Alias (User Manual Name) for VADC_G10_ICLASS1.
* To use register names with standard convension, please use VADC_G10_ICLASS1.
*/
#define	VADC_G10ICLASS1	(VADC_G10_ICLASS1)

/** \\brief  2D0C, Queue 0 Register 0, Group */
#define VADC_G10_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF0022D0Cu)

/** Alias (User Manual Name) for VADC_G10_Q0R0.
* To use register names with standard convension, please use VADC_G10_Q0R0.
*/
#define	VADC_G10Q0R0	(VADC_G10_Q0R0)

/** \\brief  2D10, Queue 0 Input Register, Group */
#define VADC_G10_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0022D10u)

/** \\brief  2D00, Queue 0 Source Control Register, Group */
#define VADC_G10_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022D00u)

/** Alias (User Manual Name) for VADC_G10_QCTRL0.
* To use register names with standard convension, please use VADC_G10_QCTRL0.
*/
#define	VADC_G10QCTRL0	(VADC_G10_QCTRL0)

/** \\brief  2D10, Queue 0 Input Register, Group */
#define VADC_G10_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0022D10u)

/** \\brief  2D04, Queue 0 Mode Register, Group */
#define VADC_G10_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022D04u)

/** Alias (User Manual Name) for VADC_G10_QMR0.
* To use register names with standard convension, please use VADC_G10_QMR0.
*/
#define	VADC_G10QMR0	(VADC_G10_QMR0)

/** \\brief  2D08, Queue 0 Status Register, Group */
#define VADC_G10_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022D08u)

/** Alias (User Manual Name) for VADC_G10_QSR0.
* To use register names with standard convension, please use VADC_G10_QSR0.
*/
#define	VADC_G10QSR0	(VADC_G10_QSR0)

/** \\brief  2E80, Group Result Control Reg. */
#define VADC_G10_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E80u)

/** Alias (User Manual Name) for VADC_G10_RCR0.
* To use register names with standard convension, please use VADC_G10_RCR0.
*/
#define	VADC_G10RCR0	(VADC_G10_RCR0)

/** \\brief  2E84, Group Result Control Reg. */
#define VADC_G10_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E84u)

/** Alias (User Manual Name) for VADC_G10_RCR1.
* To use register names with standard convension, please use VADC_G10_RCR1.
*/
#define	VADC_G10RCR1	(VADC_G10_RCR1)

/** \\brief  2EA8, Group Result Control Reg. */
#define VADC_G10_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EA8u)

