HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G10_RCR10.
* To use register names with standard convension, please use VADC_G10_RCR10.
*/
#define	VADC_G10RCR10	(VADC_G10_RCR10)

/** \\brief  2EAC, Group Result Control Reg. */
#define VADC_G10_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EACu)

/** Alias (User Manual Name) for VADC_G10_RCR11.
* To use register names with standard convension, please use VADC_G10_RCR11.
*/
#define	VADC_G10RCR11	(VADC_G10_RCR11)

/** \\brief  2EB0, Group Result Control Reg. */
#define VADC_G10_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EB0u)

/** Alias (User Manual Name) for VADC_G10_RCR12.
* To use register names with standard convension, please use VADC_G10_RCR12.
*/
#define	VADC_G10RCR12	(VADC_G10_RCR12)

/** \\brief  2EB4, Group Result Control Reg. */
#define VADC_G10_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EB4u)

/** Alias (User Manual Name) for VADC_G10_RCR13.
* To use register names with standard convension, please use VADC_G10_RCR13.
*/
#define	VADC_G10RCR13	(VADC_G10_RCR13)

/** \\brief  2EB8, Group Result Control Reg. */
#define VADC_G10_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EB8u)

/** Alias (User Manual Name) for VADC_G10_RCR14.
* To use register names with standard convension, please use VADC_G10_RCR14.
*/
#define	VADC_G10RCR14	(VADC_G10_RCR14)

/** \\brief  2EBC, Group Result Control Reg. */
#define VADC_G10_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EBCu)

/** Alias (User Manual Name) for VADC_G10_RCR15.
* To use register names with standard convension, please use VADC_G10_RCR15.
*/
#define	VADC_G10RCR15	(VADC_G10_RCR15)

/** \\brief  2E88, Group Result Control Reg. */
#define VADC_G10_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E88u)

/** Alias (User Manual Name) for VADC_G10_RCR2.
* To use register names with standard convension, please use VADC_G10_RCR2.
*/
#define	VADC_G10RCR2	(VADC_G10_RCR2)

/** \\brief  2E8C, Group Result Control Reg. */
#define VADC_G10_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E8Cu)

/** Alias (User Manual Name) for VADC_G10_RCR3.
* To use register names with standard convension, please use VADC_G10_RCR3.
*/
#define	VADC_G10RCR3	(VADC_G10_RCR3)

/** \\brief  2E90, Group Result Control Reg. */
#define VADC_G10_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E90u)

/** Alias (User Manual Name) for VADC_G10_RCR4.
* To use register names with standard convension, please use VADC_G10_RCR4.
*/
#define	VADC_G10RCR4	(VADC_G10_RCR4)

/** \\brief  2E94, Group Result Control Reg. */
#define VADC_G10_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E94u)

/** Alias (User Manual Name) for VADC_G10_RCR5.
* To use register names with standard convension, please use VADC_G10_RCR5.
*/
#define	VADC_G10RCR5	(VADC_G10_RCR5)

/** \\brief  2E98, Group Result Control Reg. */
#define VADC_G10_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E98u)

/** Alias (User Manual Name) for VADC_G10_RCR6.
* To use register names with standard convension, please use VADC_G10_RCR6.
*/
#define	VADC_G10RCR6	(VADC_G10_RCR6)

/** \\brief  2E9C, Group Result Control Reg. */
#define VADC_G10_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022E9Cu)

/** Alias (User Manual Name) for VADC_G10_RCR7.
* To use register names with standard convension, please use VADC_G10_RCR7.
*/
#define	VADC_G10RCR7	(VADC_G10_RCR7)

/** \\brief  2EA0, Group Result Control Reg. */
#define VADC_G10_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EA0u)

/** Alias (User Manual Name) for VADC_G10_RCR8.
* To use register names with standard convension, please use VADC_G10_RCR8.
*/
#define	VADC_G10RCR8	(VADC_G10_RCR8)

/** \\brief  2EA4, Group Result Control Reg. */
#define VADC_G10_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022EA4u)

/** Alias (User Manual Name) for VADC_G10_RCR9.
* To use register names with standard convension, please use VADC_G10_RCR9.
*/
#define	VADC_G10RCR9	(VADC_G10_RCR9)

/** \\brief  2D94, Result Event Flag Clear Register, Group */
#define VADC_G10_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0022D94u)

/** Alias (User Manual Name) for VADC_G10_REFCLR.
* To use register names with standard convension, please use VADC_G10_REFCLR.
*/
#define	VADC_G10REFCLR	(VADC_G10_REFCLR)

/** \\brief  2D84, Result Event Flag Register, Group */
#define VADC_G10_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0022D84u)

/** Alias (User Manual Name) for VADC_G10_REFLAG.
* To use register names with standard convension, please use VADC_G10_REFLAG.
*/
#define	VADC_G10REFLAG	(VADC_G10_REFLAG)

/** \\brief  2F00, Group Result Register */
#define VADC_G10_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F00u)

/** Alias (User Manual Name) for VADC_G10_RES0.
* To use register names with standard convension, please use VADC_G10_RES0.
*/
#define	VADC_G10RES0	(VADC_G10_RES0)

/** \\brief  2F04, Group Result Register */
#define VADC_G10_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F04u)

/** Alias (User Manual Name) for VADC_G10_RES1.
* To use register names with standard convension, please use VADC_G10_RES1.
*/
#define	VADC_G10RES1	(VADC_G10_RES1)

/** \\brief  2F28, Group Result Register */
#define VADC_G10_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F28u)

/** Alias (User Manual Name) for VADC_G10_RES10.
* To use register names with standard convension, please use VADC_G10_RES10.
*/
#define	VADC_G10RES10	(VADC_G10_RES10)

/** \\brief  2F2C, Group Result Register */
#define VADC_G10_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F2Cu)

/** Alias (User Manual Name) for VADC_G10_RES11.
* To use register names with standard convension, please use VADC_G10_RES11.
*/
#define	VADC_G10RES11	(VADC_G10_RES11)

/** \\brief  2F30, Group Result Register */
#define VADC_G10_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F30u)

/** Alias (User Manual Name) for VADC_G10_RES12.
* To use register names with standard convension, please use VADC_G10_RES12.
*/
#define	VADC_G10RES12	(VADC_G10_RES12)

