HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** \\brief  2F34, Group Result Register */
#define VADC_G10_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F34u)

/** Alias (User Manual Name) for VADC_G10_RES13.
* To use register names with standard convension, please use VADC_G10_RES13.
*/
#define	VADC_G10RES13	(VADC_G10_RES13)

/** \\brief  2F38, Group Result Register */
#define VADC_G10_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F38u)

/** Alias (User Manual Name) for VADC_G10_RES14.
* To use register names with standard convension, please use VADC_G10_RES14.
*/
#define	VADC_G10RES14	(VADC_G10_RES14)

/** \\brief  2F3C, Group Result Register */
#define VADC_G10_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F3Cu)

/** Alias (User Manual Name) for VADC_G10_RES15.
* To use register names with standard convension, please use VADC_G10_RES15.
*/
#define	VADC_G10RES15	(VADC_G10_RES15)

/** \\brief  2F08, Group Result Register */
#define VADC_G10_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F08u)

/** Alias (User Manual Name) for VADC_G10_RES2.
* To use register names with standard convension, please use VADC_G10_RES2.
*/
#define	VADC_G10RES2	(VADC_G10_RES2)

/** \\brief  2F0C, Group Result Register */
#define VADC_G10_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F0Cu)

/** Alias (User Manual Name) for VADC_G10_RES3.
* To use register names with standard convension, please use VADC_G10_RES3.
*/
#define	VADC_G10RES3	(VADC_G10_RES3)

/** \\brief  2F10, Group Result Register */
#define VADC_G10_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F10u)

/** Alias (User Manual Name) for VADC_G10_RES4.
* To use register names with standard convension, please use VADC_G10_RES4.
*/
#define	VADC_G10RES4	(VADC_G10_RES4)

/** \\brief  2F14, Group Result Register */
#define VADC_G10_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F14u)

/** Alias (User Manual Name) for VADC_G10_RES5.
* To use register names with standard convension, please use VADC_G10_RES5.
*/
#define	VADC_G10RES5	(VADC_G10_RES5)

/** \\brief  2F18, Group Result Register */
#define VADC_G10_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F18u)

/** Alias (User Manual Name) for VADC_G10_RES6.
* To use register names with standard convension, please use VADC_G10_RES6.
*/
#define	VADC_G10RES6	(VADC_G10_RES6)

/** \\brief  2F1C, Group Result Register */
#define VADC_G10_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F1Cu)

/** Alias (User Manual Name) for VADC_G10_RES7.
* To use register names with standard convension, please use VADC_G10_RES7.
*/
#define	VADC_G10RES7	(VADC_G10_RES7)

/** \\brief  2F20, Group Result Register */
#define VADC_G10_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F20u)

/** Alias (User Manual Name) for VADC_G10_RES8.
* To use register names with standard convension, please use VADC_G10_RES8.
*/
#define	VADC_G10RES8	(VADC_G10_RES8)

/** \\brief  2F24, Group Result Register */
#define VADC_G10_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022F24u)

/** Alias (User Manual Name) for VADC_G10_RES9.
* To use register names with standard convension, please use VADC_G10_RES9.
*/
#define	VADC_G10RES9	(VADC_G10_RES9)

/** \\brief  2F80, Group Result Reg., Debug */
#define VADC_G10_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F80u)

/** Alias (User Manual Name) for VADC_G10_RESD0.
* To use register names with standard convension, please use VADC_G10_RESD0.
*/
#define	VADC_G10RESD0	(VADC_G10_RESD0)

/** \\brief  2F84, Group Result Reg., Debug */
#define VADC_G10_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F84u)

/** Alias (User Manual Name) for VADC_G10_RESD1.
* To use register names with standard convension, please use VADC_G10_RESD1.
*/
#define	VADC_G10RESD1	(VADC_G10_RESD1)

/** \\brief  2FA8, Group Result Reg., Debug */
#define VADC_G10_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FA8u)

/** Alias (User Manual Name) for VADC_G10_RESD10.
* To use register names with standard convension, please use VADC_G10_RESD10.
*/
#define	VADC_G10RESD10	(VADC_G10_RESD10)

/** \\brief  2FAC, Group Result Reg., Debug */
#define VADC_G10_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FACu)

/** Alias (User Manual Name) for VADC_G10_RESD11.
* To use register names with standard convension, please use VADC_G10_RESD11.
*/
#define	VADC_G10RESD11	(VADC_G10_RESD11)

/** \\brief  2FB0, Group Result Reg., Debug */
#define VADC_G10_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FB0u)

/** Alias (User Manual Name) for VADC_G10_RESD12.
* To use register names with standard convension, please use VADC_G10_RESD12.
*/
#define	VADC_G10RESD12	(VADC_G10_RESD12)

/** \\brief  2FB4, Group Result Reg., Debug */
#define VADC_G10_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FB4u)

/** Alias (User Manual Name) for VADC_G10_RESD13.
* To use register names with standard convension, please use VADC_G10_RESD13.
*/
#define	VADC_G10RESD13	(VADC_G10_RESD13)

/** \\brief  2FB8, Group Result Reg., Debug */
#define VADC_G10_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FB8u)

/** Alias (User Manual Name) for VADC_G10_RESD14.
* To use register names with standard convension, please use VADC_G10_RESD14.
*/
#define	VADC_G10RESD14	(VADC_G10_RESD14)

/** \\brief  2FBC, Group Result Reg., Debug */
#define VADC_G10_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FBCu)

/** Alias (User Manual Name) for VADC_G10_RESD15.
* To use register names with standard convension, please use VADC_G10_RESD15.
*/
#define	VADC_G10RESD15	(VADC_G10_RESD15)

/** \\brief  2F88, Group Result Reg., Debug */
#define VADC_G10_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F88u)

/** Alias (User Manual Name) for VADC_G10_RESD2.
* To use register names with standard convension, please use VADC_G10_RESD2.
*/
#define	VADC_G10RESD2	(VADC_G10_RESD2)

/** \\brief  2F8C, Group Result Reg., Debug */
#define VADC_G10_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F8Cu)

/** Alias (User Manual Name) for VADC_G10_RESD3.
* To use register names with standard convension, please use VADC_G10_RESD3.
*/
#define	VADC_G10RESD3	(VADC_G10_RESD3)

/** \\brief  2F90, Group Result Reg., Debug */
#define VADC_G10_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F90u)

/** Alias (User Manual Name) for VADC_G10_RESD4.
* To use register names with standard convension, please use VADC_G10_RESD4.
*/
#define	VADC_G10RESD4	(VADC_G10_RESD4)

/** \\brief  2F94, Group Result Reg., Debug */
#define VADC_G10_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F94u)

/** Alias (User Manual Name) for VADC_G10_RESD5.
* To use register names with standard convension, please use VADC_G10_RESD5.
*/
#define	VADC_G10RESD5	(VADC_G10_RESD5)

/** \\brief  2F98, Group Result Reg., Debug */
#define VADC_G10_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F98u)

