HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G10_RESD6.
* To use register names with standard convension, please use VADC_G10_RESD6.
*/
#define	VADC_G10RESD6	(VADC_G10_RESD6)

/** \\brief  2F9C, Group Result Reg., Debug */
#define VADC_G10_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F9Cu)

/** Alias (User Manual Name) for VADC_G10_RESD7.
* To use register names with standard convension, please use VADC_G10_RESD7.
*/
#define	VADC_G10RESD7	(VADC_G10_RESD7)

/** \\brief  2FA0, Group Result Reg., Debug */
#define VADC_G10_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FA0u)

/** Alias (User Manual Name) for VADC_G10_RESD8.
* To use register names with standard convension, please use VADC_G10_RESD8.
*/
#define	VADC_G10RESD8	(VADC_G10_RESD8)

/** \\brief  2FA4, Group Result Reg., Debug */
#define VADC_G10_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FA4u)

/** Alias (User Manual Name) for VADC_G10_RESD9.
* To use register names with standard convension, please use VADC_G10_RESD9.
*/
#define	VADC_G10RESD9	(VADC_G10_RESD9)

/** \\brief  2DB0, Result Event Node Pointer Register 0, Group */
#define VADC_G10_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF0022DB0u)

/** Alias (User Manual Name) for VADC_G10_REVNP0.
* To use register names with standard convension, please use VADC_G10_REVNP0.
*/
#define	VADC_G10REVNP0	(VADC_G10_REVNP0)

/** \\brief  2DB4, Result Event Node Pointer Register 1, Group */
#define VADC_G10_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF0022DB4u)

/** Alias (User Manual Name) for VADC_G10_REVNP1.
* To use register names with standard convension, please use VADC_G10_REVNP1.
*/
#define	VADC_G10REVNP1	(VADC_G10_REVNP1)

/** \\brief  2C8C, Result Assignment Register, Group */
#define VADC_G10_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF0022C8Cu)

/** Alias (User Manual Name) for VADC_G10_RRASS.
* To use register names with standard convension, please use VADC_G10_RRASS.
*/
#define	VADC_G10RRASS	(VADC_G10_RRASS)

/** \\brief  2D98, Source Event Flag Clear Register, Group */
#define VADC_G10_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022D98u)

/** Alias (User Manual Name) for VADC_G10_SEFCLR.
* To use register names with standard convension, please use VADC_G10_SEFCLR.
*/
#define	VADC_G10SEFCLR	(VADC_G10_SEFCLR)

/** \\brief  2D88, Source Event Flag Register, Group */
#define VADC_G10_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022D88u)

/** Alias (User Manual Name) for VADC_G10_SEFLAG.
* To use register names with standard convension, please use VADC_G10_SEFLAG.
*/
#define	VADC_G10SEFLAG	(VADC_G10_SEFLAG)

/** \\brief  2DC0, Source Event Node Pointer Register, Group */
#define VADC_G10_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF0022DC0u)

/** Alias (User Manual Name) for VADC_G10_SEVNP.
* To use register names with standard convension, please use VADC_G10_SEVNP.
*/
#define	VADC_G10SEVNP	(VADC_G10_SEVNP)

/** \\brief  2DC8, Service Request Software Activation Trigger, Group */
#define VADC_G10_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF0022DC8u)

/** Alias (User Manual Name) for VADC_G10_SRACT.
* To use register names with standard convension, please use VADC_G10_SRACT.
*/
#define	VADC_G10SRACT	(VADC_G10_SRACT)

/** \\brief  2CC0, Synchronization Control Register, Group */
#define VADC_G10_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF0022CC0u)

/** Alias (User Manual Name) for VADC_G10_SYNCTR.
* To use register names with standard convension, please use VADC_G10_SYNCTR.
*/
#define	VADC_G10SYNCTR	(VADC_G10_SYNCTR)

/** \\brief  2DF8, Valid Flag Register, Group */
#define VADC_G10_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF0022DF8u)

/** Alias (User Manual Name) for VADC_G10_VFR.
* To use register names with standard convension, please use VADC_G10_VFR.
*/
#define	VADC_G10VFR	(VADC_G10_VFR)

/** \\brief  8B0, Alias Register, Group */
#define VADC_G1_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00208B0u)

/** Alias (User Manual Name) for VADC_G1_ALIAS.
* To use register names with standard convension, please use VADC_G1_ALIAS.
*/
#define	VADC_G1ALIAS	(VADC_G1_ALIAS)

/** \\brief  880, Arbitration Configuration Register, Group */
#define VADC_G1_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0020880u)

/** Alias (User Manual Name) for VADC_G1_ARBCFG.
* To use register names with standard convension, please use VADC_G1_ARBCFG.
*/
#define	VADC_G1ARBCFG	(VADC_G1_ARBCFG)

/** \\brief  884, Arbitration Priority Register, Group */
#define VADC_G1_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0020884u)

/** Alias (User Manual Name) for VADC_G1_ARBPR.
* To use register names with standard convension, please use VADC_G1_ARBPR.
*/
#define	VADC_G1ARBPR	(VADC_G1_ARBPR)

/** \\brief  920, Autoscan Source Control Register, Group */
#define VADC_G1_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0020920u)

/** Alias (User Manual Name) for VADC_G1_ASCTRL.
* To use register names with standard convension, please use VADC_G1_ASCTRL.
*/
#define	VADC_G1ASCTRL	(VADC_G1_ASCTRL)

/** \\brief  924, Autoscan Source Mode Register, Group */
#define VADC_G1_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0020924u)

/** Alias (User Manual Name) for VADC_G1_ASMR.
* To use register names with standard convension, please use VADC_G1_ASMR.
*/
#define	VADC_G1ASMR	(VADC_G1_ASMR)

/** \\brief  92C, Autoscan Source Pending Register, Group */
#define VADC_G1_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002092Cu)

/** Alias (User Manual Name) for VADC_G1_ASPND.
* To use register names with standard convension, please use VADC_G1_ASPND.
*/
#define	VADC_G1ASPND	(VADC_G1_ASPND)

/** \\brief  928, Autoscan Source Channel Select Register, Group */
#define VADC_G1_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0020928u)

/** Alias (User Manual Name) for VADC_G1_ASSEL.
* To use register names with standard convension, please use VADC_G1_ASSEL.
*/
#define	VADC_G1ASSEL	(VADC_G1_ASSEL)

/** \\brief  8C8, Boundary Flag Register, Group */
#define VADC_G1_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00208C8u)

