HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** \\brief  2528, Autoscan Source Channel Select Register, Group */
#define VADC_G8_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022528u)

/** Alias (User Manual Name) for VADC_G8_ASSEL.
* To use register names with standard convension, please use VADC_G8_ASSEL.
*/
#define	VADC_G8ASSEL	(VADC_G8_ASSEL)

/** \\brief  24C8, Boundary Flag Register, Group */
#define VADC_G8_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00224C8u)

/** Alias (User Manual Name) for VADC_G8_BFL.
* To use register names with standard convension, please use VADC_G8_BFL.
*/
#define	VADC_G8BFL	(VADC_G8_BFL)

/** \\brief  24D0, Boundary Flag Control Register, Group */
#define VADC_G8_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00224D0u)

/** Alias (User Manual Name) for VADC_G8_BFLC.
* To use register names with standard convension, please use VADC_G8_BFLC.
*/
#define	VADC_G8BFLC	(VADC_G8_BFLC)

/** \\brief  24D4, Boundary Flag Node Pointer Register, Group */
#define VADC_G8_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF00224D4u)

/** Alias (User Manual Name) for VADC_G8_BFLNP.
* To use register names with standard convension, please use VADC_G8_BFLNP.
*/
#define	VADC_G8BFLNP	(VADC_G8_BFLNP)

/** \\brief  24CC, Boundary Flag Software Register, Group */
#define VADC_G8_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00224CCu)

/** Alias (User Manual Name) for VADC_G8_BFLS.
* To use register names with standard convension, please use VADC_G8_BFLS.
*/
#define	VADC_G8BFLS	(VADC_G8_BFLS)

/** \\brief  24B8, Boundary Select Register, Group */
#define VADC_G8_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00224B8u)

/** Alias (User Manual Name) for VADC_G8_BOUND.
* To use register names with standard convension, please use VADC_G8_BOUND.
*/
#define	VADC_G8BOUND	(VADC_G8_BOUND)

/** \\brief  2590, Channel Event Flag Clear Register, Group */
#define VADC_G8_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022590u)

/** Alias (User Manual Name) for VADC_G8_CEFCLR.
* To use register names with standard convension, please use VADC_G8_CEFCLR.
*/
#define	VADC_G8CEFCLR	(VADC_G8_CEFCLR)

/** \\brief  2580, Channel Event Flag Register, Group */
#define VADC_G8_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022580u)

/** Alias (User Manual Name) for VADC_G8_CEFLAG.
* To use register names with standard convension, please use VADC_G8_CEFLAG.
*/
#define	VADC_G8CEFLAG	(VADC_G8_CEFLAG)

/** \\brief  25A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G8_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00225A0u)

/** Alias (User Manual Name) for VADC_G8_CEVNP0.
* To use register names with standard convension, please use VADC_G8_CEVNP0.
*/
#define	VADC_G8CEVNP0	(VADC_G8_CEVNP0)

/** \\brief  2488, Channel Assignment Register, Group */
#define VADC_G8_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022488u)

/** Alias (User Manual Name) for VADC_G8_CHASS.
* To use register names with standard convension, please use VADC_G8_CHASS.
*/
#define	VADC_G8CHASS	(VADC_G8_CHASS)

/** \\brief  2600, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022600u)

/** Alias (User Manual Name) for VADC_G8_CHCTR0.
* To use register names with standard convension, please use VADC_G8_CHCTR0.
*/
#define	VADC_G8CHCTR0	(VADC_G8_CHCTR0)

/** \\brief  2604, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022604u)

/** Alias (User Manual Name) for VADC_G8_CHCTR1.
* To use register names with standard convension, please use VADC_G8_CHCTR1.
*/
#define	VADC_G8CHCTR1	(VADC_G8_CHCTR1)







/** \\brief  2608, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022608u)

/** Alias (User Manual Name) for VADC_G8_CHCTR2.
* To use register names with standard convension, please use VADC_G8_CHCTR2.
*/
#define	VADC_G8CHCTR2	(VADC_G8_CHCTR2)

/** \\brief  260C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002260Cu)

/** Alias (User Manual Name) for VADC_G8_CHCTR3.
* To use register names with standard convension, please use VADC_G8_CHCTR3.
*/
#define	VADC_G8CHCTR3	(VADC_G8_CHCTR3)

/** \\brief  2610, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022610u)

/** Alias (User Manual Name) for VADC_G8_CHCTR4.
* To use register names with standard convension, please use VADC_G8_CHCTR4.
*/
#define	VADC_G8CHCTR4	(VADC_G8_CHCTR4)

/** \\brief  2614, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022614u)

/** Alias (User Manual Name) for VADC_G8_CHCTR5.
* To use register names with standard convension, please use VADC_G8_CHCTR5.
*/
#define	VADC_G8CHCTR5	(VADC_G8_CHCTR5)

/** \\brief  2618, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022618u)

/** Alias (User Manual Name) for VADC_G8_CHCTR6.
* To use register names with standard convension, please use VADC_G8_CHCTR6.
*/
#define	VADC_G8CHCTR6	(VADC_G8_CHCTR6)

/** \\brief  261C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002261Cu)

/** Alias (User Manual Name) for VADC_G8_CHCTR7.
* To use register names with standard convension, please use VADC_G8_CHCTR7.
*/
#define	VADC_G8CHCTR7	(VADC_G8_CHCTR7)



/** \\brief  25F0, External Multiplexer Control Register, Group x */
#define VADC_G8_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00225F0u)

/** Alias (User Manual Name) for VADC_G8_EMUXCTR.
* To use register names with standard convension, please use VADC_G8_EMUXCTR.
*/
#define	VADC_G8EMUXCTR	(VADC_G8_EMUXCTR)

/** \\brief  24A0, Input Class Register */
#define VADC_G8_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00224A0u)

/** Alias (User Manual Name) for VADC_G8_ICLASS0.
* To use register names with standard convension, please use VADC_G8_ICLASS0.
*/
#define	VADC_G8ICLASS0	(VADC_G8_ICLASS0)

/** \\brief  24A4, Input Class Register */
#define VADC_G8_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00224A4u)

