HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G8_ICLASS1.
* To use register names with standard convension, please use VADC_G8_ICLASS1.
*/
#define	VADC_G8ICLASS1	(VADC_G8_ICLASS1)

/** \\brief  250C, Queue 0 Register 0, Group */
#define VADC_G8_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002250Cu)

/** Alias (User Manual Name) for VADC_G8_Q0R0.
* To use register names with standard convension, please use VADC_G8_Q0R0.
*/
#define	VADC_G8Q0R0	(VADC_G8_Q0R0)

/** \\brief  2510, Queue 0 Input Register, Group */
#define VADC_G8_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0022510u)

/** Alias (User Manual Name) for VADC_G8_QBUR0.
* To use register names with standard convension, please use VADC_G8_QBUR0.
*/
#define	VADC_G8QBUR0	(VADC_G8_QBUR0)

/** \\brief  2500, Queue 0 Source Control Register, Group */
#define VADC_G8_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022500u)

/** Alias (User Manual Name) for VADC_G8_QCTRL0.
* To use register names with standard convension, please use VADC_G8_QCTRL0.
*/
#define	VADC_G8QCTRL0	(VADC_G8_QCTRL0)

/** \\brief  2510, Queue 0 Input Register, Group */
#define VADC_G8_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0022510u)

/** Alias (User Manual Name) for VADC_G8_QINR0.
* To use register names with standard convension, please use VADC_G8_QINR0.
*/
#define	VADC_G8QINR0	(VADC_G8_QINR0)

/** \\brief  2504, Queue 0 Mode Register, Group */
#define VADC_G8_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022504u)

/** Alias (User Manual Name) for VADC_G8_QMR0.
* To use register names with standard convension, please use VADC_G8_QMR0.
*/
#define	VADC_G8QMR0	(VADC_G8_QMR0)

/** \\brief  2508, Queue 0 Status Register, Group */
#define VADC_G8_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022508u)

/** Alias (User Manual Name) for VADC_G8_QSR0.
* To use register names with standard convension, please use VADC_G8_QSR0.
*/
#define	VADC_G8QSR0	(VADC_G8_QSR0)

/** \\brief  2680, Group Result Control Reg. */
#define VADC_G8_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022680u)

/** Alias (User Manual Name) for VADC_G8_RCR0.
* To use register names with standard convension, please use VADC_G8_RCR0.
*/
#define	VADC_G8RCR0	(VADC_G8_RCR0)

/** \\brief  2684, Group Result Control Reg. */
#define VADC_G8_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022684u)

/** Alias (User Manual Name) for VADC_G8_RCR1.
* To use register names with standard convension, please use VADC_G8_RCR1.
*/
#define	VADC_G8RCR1	(VADC_G8_RCR1)

/** \\brief  26A8, Group Result Control Reg. */
#define VADC_G8_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226A8u)

/** Alias (User Manual Name) for VADC_G8_RCR10.
* To use register names with standard convension, please use VADC_G8_RCR10.
*/
#define	VADC_G8RCR10	(VADC_G8_RCR10)

/** \\brief  26AC, Group Result Control Reg. */
#define VADC_G8_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226ACu)

/** Alias (User Manual Name) for VADC_G8_RCR11.
* To use register names with standard convension, please use VADC_G8_RCR11.
*/
#define	VADC_G8RCR11	(VADC_G8_RCR11)

/** \\brief  26B0, Group Result Control Reg. */
#define VADC_G8_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226B0u)

/** Alias (User Manual Name) for VADC_G8_RCR12.
* To use register names with standard convension, please use VADC_G8_RCR12.
*/
#define	VADC_G8RCR12	(VADC_G8_RCR12)

/** \\brief  26B4, Group Result Control Reg. */
#define VADC_G8_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226B4u)

/** Alias (User Manual Name) for VADC_G8_RCR13.
* To use register names with standard convension, please use VADC_G8_RCR13.
*/
#define	VADC_G8RCR13	(VADC_G8_RCR13)

/** \\brief  26B8, Group Result Control Reg. */
#define VADC_G8_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226B8u)

/** Alias (User Manual Name) for VADC_G8_RCR14.
* To use register names with standard convension, please use VADC_G8_RCR14.
*/
#define	VADC_G8RCR14	(VADC_G8_RCR14)

/** \\brief  26BC, Group Result Control Reg. */
#define VADC_G8_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226BCu)

/** Alias (User Manual Name) for VADC_G8_RCR15.
* To use register names with standard convension, please use VADC_G8_RCR15.
*/
#define	VADC_G8RCR15	(VADC_G8_RCR15)

/** \\brief  2688, Group Result Control Reg. */
#define VADC_G8_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022688u)

/** Alias (User Manual Name) for VADC_G8_RCR2.
* To use register names with standard convension, please use VADC_G8_RCR2.
*/
#define	VADC_G8RCR2	(VADC_G8_RCR2)

/** \\brief  268C, Group Result Control Reg. */
#define VADC_G8_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002268Cu)

/** Alias (User Manual Name) for VADC_G8_RCR3.
* To use register names with standard convension, please use VADC_G8_RCR3.
*/
#define	VADC_G8RCR3	(VADC_G8_RCR3)

/** \\brief  2690, Group Result Control Reg. */
#define VADC_G8_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022690u)

/** Alias (User Manual Name) for VADC_G8_RCR4.
* To use register names with standard convension, please use VADC_G8_RCR4.
*/
#define	VADC_G8RCR4	(VADC_G8_RCR4)

/** \\brief  2694, Group Result Control Reg. */
#define VADC_G8_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022694u)

/** Alias (User Manual Name) for VADC_G8_RCR5.
* To use register names with standard convension, please use VADC_G8_RCR5.
*/
#define	VADC_G8RCR5	(VADC_G8_RCR5)

/** \\brief  2698, Group Result Control Reg. */
#define VADC_G8_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022698u)

/** Alias (User Manual Name) for VADC_G8_RCR6.
* To use register names with standard convension, please use VADC_G8_RCR6.
*/
#define	VADC_G8RCR6	(VADC_G8_RCR6)

/** \\brief  269C, Group Result Control Reg. */
#define VADC_G8_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002269Cu)

/** Alias (User Manual Name) for VADC_G8_RCR7.
* To use register names with standard convension, please use VADC_G8_RCR7.
*/
#define	VADC_G8RCR7	(VADC_G8_RCR7)

/** \\brief  26A0, Group Result Control Reg. */
#define VADC_G8_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226A0u)

/** Alias (User Manual Name) for VADC_G8_RCR8.
* To use register names with standard convension, please use VADC_G8_RCR8.
*/
#define	VADC_G8RCR8	(VADC_G8_RCR8)

/** \\brief  26A4, Group Result Control Reg. */
#define VADC_G8_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00226A4u)

/** Alias (User Manual Name) for VADC_G8_RCR9.
* To use register names with standard convension, please use VADC_G8_RCR9.
*/
#define	VADC_G8RCR9	(VADC_G8_RCR9)

