HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** \\brief  2928, Autoscan Source Channel Select Register, Group */
#define VADC_G9_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022928u)

/** Alias (User Manual Name) for VADC_G9_ASSEL.
* To use register names with standard convension, please use VADC_G9_ASSEL.
*/
#define	VADC_G9ASSEL	(VADC_G9_ASSEL)

/** \\brief  28C8, Boundary Flag Register, Group */
#define VADC_G9_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00228C8u)

/** Alias (User Manual Name) for VADC_G9_BFL.
* To use register names with standard convension, please use VADC_G9_BFL.
*/
#define	VADC_G9BFL	(VADC_G9_BFL)

/** \\brief  28D0, Boundary Flag Control Register, Group */
#define VADC_G9_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00228D0u)

/** Alias (User Manual Name) for VADC_G9_BFLC.
* To use register names with standard convension, please use VADC_G9_BFLC.
*/
#define	VADC_G9BFLC	(VADC_G9_BFLC)

/** \\brief  28D4, Boundary Flag Node Pointer Register, Group */
#define VADC_G9_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF00228D4u)

/** Alias (User Manual Name) for VADC_G9_BFLNP.
* To use register names with standard convension, please use VADC_G9_BFLNP.
*/
#define	VADC_G9BFLNP	(VADC_G9_BFLNP)

/** \\brief  28CC, Boundary Flag Software Register, Group */
#define VADC_G9_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00228CCu)

/** Alias (User Manual Name) for VADC_G9_BFLS.
* To use register names with standard convension, please use VADC_G9_BFLS.
*/
#define	VADC_G9BFLS	(VADC_G9_BFLS)

/** \\brief  28B8, Boundary Select Register, Group */
#define VADC_G9_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00228B8u)

/** Alias (User Manual Name) for VADC_G9_BOUND.
* To use register names with standard convension, please use VADC_G9_BOUND.
*/
#define	VADC_G9BOUND	(VADC_G9_BOUND)

/** \\brief  2990, Channel Event Flag Clear Register, Group */
#define VADC_G9_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022990u)

/** Alias (User Manual Name) for VADC_G9_CEFCLR.
* To use register names with standard convension, please use VADC_G9_CEFCLR.
*/
#define	VADC_G9CEFCLR	(VADC_G9_CEFCLR)

/** \\brief  2980, Channel Event Flag Register, Group */
#define VADC_G9_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022980u)

/** Alias (User Manual Name) for VADC_G9_CEFLAG.
* To use register names with standard convension, please use VADC_G9_CEFLAG.
*/
#define	VADC_G9CEFLAG	(VADC_G9_CEFLAG)

/** \\brief  29A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G9_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00229A0u)

/** Alias (User Manual Name) for VADC_G9_CEVNP0.
* To use register names with standard convension, please use VADC_G9_CEVNP0.
*/
#define	VADC_G9CEVNP0	(VADC_G9_CEVNP0)

/** \\brief  2888, Channel Assignment Register, Group */
#define VADC_G9_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022888u)

/** Alias (User Manual Name) for VADC_G9_CHASS.
* To use register names with standard convension, please use VADC_G9_CHASS.
*/
#define	VADC_G9CHASS	(VADC_G9_CHASS)

/** \\brief  2A00, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A00u)

/** Alias (User Manual Name) for VADC_G9_CHCTR0.
* To use register names with standard convension, please use VADC_G9_CHCTR0.
*/
#define	VADC_G9CHCTR0	(VADC_G9_CHCTR0)

/** \\brief  2A04, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A04u)

/** Alias (User Manual Name) for VADC_G9_CHCTR1.
* To use register names with standard convension, please use VADC_G9_CHCTR1.
*/
#define	VADC_G9CHCTR1	(VADC_G9_CHCTR1)







/** \\brief  2A08, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A08u)

/** Alias (User Manual Name) for VADC_G9_CHCTR2.
* To use register names with standard convension, please use VADC_G9_CHCTR2.
*/
#define	VADC_G9CHCTR2	(VADC_G9_CHCTR2)

/** \\brief  2A0C, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A0Cu)

/** Alias (User Manual Name) for VADC_G9_CHCTR3.
* To use register names with standard convension, please use VADC_G9_CHCTR3.
*/
#define	VADC_G9CHCTR3	(VADC_G9_CHCTR3)

/** \\brief  2A10, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A10u)

/** Alias (User Manual Name) for VADC_G9_CHCTR4.
* To use register names with standard convension, please use VADC_G9_CHCTR4.
*/
#define	VADC_G9CHCTR4	(VADC_G9_CHCTR4)

/** \\brief  2A14, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A14u)

/** Alias (User Manual Name) for VADC_G9_CHCTR5.
* To use register names with standard convension, please use VADC_G9_CHCTR5.
*/
#define	VADC_G9CHCTR5	(VADC_G9_CHCTR5)

/** \\brief  2A18, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A18u)

/** Alias (User Manual Name) for VADC_G9_CHCTR6.
* To use register names with standard convension, please use VADC_G9_CHCTR6.
*/
#define	VADC_G9CHCTR6	(VADC_G9_CHCTR6)

/** \\brief  2A1C, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A1Cu)

/** Alias (User Manual Name) for VADC_G9_CHCTR7.
* To use register names with standard convension, please use VADC_G9_CHCTR7.
*/
#define	VADC_G9CHCTR7	(VADC_G9_CHCTR7)



/** \\brief  29F0, External Multiplexer Control Register, Group x */
#define VADC_G9_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00229F0u)

/** Alias (User Manual Name) for VADC_G9_EMUXCTR.
* To use register names with standard convension, please use VADC_G9_EMUXCTR.
*/
#define	VADC_G9EMUXCTR	(VADC_G9_EMUXCTR)

/** \\brief  28A0, Input Class Register */
#define VADC_G9_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00228A0u)

/** Alias (User Manual Name) for VADC_G9_ICLASS0.
* To use register names with standard convension, please use VADC_G9_ICLASS0.
*/
#define	VADC_G9ICLASS0	(VADC_G9_ICLASS0)

/** \\brief  28A4, Input Class Register */
#define VADC_G9_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00228A4u)

/** Alias (User Manual Name) for VADC_G9_ICLASS1.
* To use register names with standard convension, please use VADC_G9_ICLASS1.
*/
#define	VADC_G9ICLASS1	(VADC_G9_ICLASS1)

/** \\brief  290C, Queue 0 Register 0, Group */
#define VADC_G9_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002290Cu)

/** Alias (User Manual Name) for VADC_G9_Q0R0.
* To use register names with standard convension, please use VADC_G9_Q0R0.
*/
#define	VADC_G9Q0R0	(VADC_G9_Q0R0)

/** \\brief  2910, Queue 0 Input Register, Group */
#define VADC_G9_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0022910u)

/** Alias (User Manual Name) for VADC_G9_QBUR0.
* To use register names with standard convension, please use VADC_G9_QBUR0.
*/
#define	VADC_G9QBUR0	(VADC_G9_QBUR0)

/** \\brief  2900, Queue 0 Source Control Register, Group */
#define VADC_G9_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022900u)

/** Alias (User Manual Name) for VADC_G9_QCTRL0.
* To use register names with standard convension, please use VADC_G9_QCTRL0.
*/
#define	VADC_G9QCTRL0	(VADC_G9_QCTRL0)

/** \\brief  2910, Queue 0 Input Register, Group */
#define VADC_G9_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0022910u)

