HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G9_QINR0.
* To use register names with standard convension, please use VADC_G9_QINR0.
*/
#define	VADC_G9QINR0	(VADC_G9_QINR0)

/** \\brief  2904, Queue 0 Mode Register, Group */
#define VADC_G9_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022904u)

/** Alias (User Manual Name) for VADC_G9_QMR0.
* To use register names with standard convension, please use VADC_G9_QMR0.
*/
#define	VADC_G9QMR0	(VADC_G9_QMR0)

/** \\brief  2908, Queue 0 Status Register, Group */
#define VADC_G9_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022908u)

/** Alias (User Manual Name) for VADC_G9_QSR0.
* To use register names with standard convension, please use VADC_G9_QSR0.
*/
#define	VADC_G9QSR0	(VADC_G9_QSR0)

/** \\brief  2A80, Group Result Control Reg. */
#define VADC_G9_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A80u)

/** Alias (User Manual Name) for VADC_G9_RCR0.
* To use register names with standard convension, please use VADC_G9_RCR0.
*/
#define	VADC_G9RCR0	(VADC_G9_RCR0)

/** \\brief  2A84, Group Result Control Reg. */
#define VADC_G9_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A84u)

/** Alias (User Manual Name) for VADC_G9_RCR1.
* To use register names with standard convension, please use VADC_G9_RCR1.
*/
#define	VADC_G9RCR1	(VADC_G9_RCR1)

/** \\brief  2AA8, Group Result Control Reg. */
#define VADC_G9_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AA8u)

/** Alias (User Manual Name) for VADC_G9_RCR10.
* To use register names with standard convension, please use VADC_G9_RCR10.
*/
#define	VADC_G9RCR10	(VADC_G9_RCR10)

/** \\brief  2AAC, Group Result Control Reg. */
#define VADC_G9_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AACu)

/** Alias (User Manual Name) for VADC_G9_RCR11.
* To use register names with standard convension, please use VADC_G9_RCR11.
*/
#define	VADC_G9RCR11	(VADC_G9_RCR11)

/** \\brief  2AB0, Group Result Control Reg. */
#define VADC_G9_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB0u)

/** Alias (User Manual Name) for VADC_G9_RCR12.
* To use register names with standard convension, please use VADC_G9_RCR12.
*/
#define	VADC_G9RCR12	(VADC_G9_RCR12)

/** \\brief  2AB4, Group Result Control Reg. */
#define VADC_G9_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB4u)

/** Alias (User Manual Name) for VADC_G9_RCR13.
* To use register names with standard convension, please use VADC_G9_RCR13.
*/
#define	VADC_G9RCR13	(VADC_G9_RCR13)

/** \\brief  2AB8, Group Result Control Reg. */
#define VADC_G9_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB8u)

/** Alias (User Manual Name) for VADC_G9_RCR14.
* To use register names with standard convension, please use VADC_G9_RCR14.
*/
#define	VADC_G9RCR14	(VADC_G9_RCR14)

/** \\brief  2ABC, Group Result Control Reg. */
#define VADC_G9_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022ABCu)

/** Alias (User Manual Name) for VADC_G9_RCR15.
* To use register names with standard convension, please use VADC_G9_RCR15.
*/
#define	VADC_G9RCR15	(VADC_G9_RCR15)

/** \\brief  2A88, Group Result Control Reg. */
#define VADC_G9_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A88u)

/** Alias (User Manual Name) for VADC_G9_RCR2.
* To use register names with standard convension, please use VADC_G9_RCR2.
*/
#define	VADC_G9RCR2	(VADC_G9_RCR2)

/** \\brief  2A8C, Group Result Control Reg. */
#define VADC_G9_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A8Cu)

/** Alias (User Manual Name) for VADC_G9_RCR3.
* To use register names with standard convension, please use VADC_G9_RCR3.
*/
#define	VADC_G9RCR3	(VADC_G9_RCR3)

/** \\brief  2A90, Group Result Control Reg. */
#define VADC_G9_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A90u)

/** Alias (User Manual Name) for VADC_G9_RCR4.
* To use register names with standard convension, please use VADC_G9_RCR4.
*/
#define	VADC_G9RCR4	(VADC_G9_RCR4)

/** \\brief  2A94, Group Result Control Reg. */
#define VADC_G9_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A94u)

/** Alias (User Manual Name) for VADC_G9_RCR5.
* To use register names with standard convension, please use VADC_G9_RCR5.
*/
#define	VADC_G9RCR5	(VADC_G9_RCR5)

/** \\brief  2A98, Group Result Control Reg. */
#define VADC_G9_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A98u)

/** Alias (User Manual Name) for VADC_G9_RCR6.
* To use register names with standard convension, please use VADC_G9_RCR6.
*/
#define	VADC_G9RCR6	(VADC_G9_RCR6)

/** \\brief  2A9C, Group Result Control Reg. */
#define VADC_G9_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A9Cu)

/** Alias (User Manual Name) for VADC_G9_RCR7.
* To use register names with standard convension, please use VADC_G9_RCR7.
*/
#define	VADC_G9RCR7	(VADC_G9_RCR7)

/** \\brief  2AA0, Group Result Control Reg. */
#define VADC_G9_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AA0u)

/** Alias (User Manual Name) for VADC_G9_RCR8.
* To use register names with standard convension, please use VADC_G9_RCR8.
*/
#define	VADC_G9RCR8	(VADC_G9_RCR8)

/** \\brief  2AA4, Group Result Control Reg. */
#define VADC_G9_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AA4u)

/** Alias (User Manual Name) for VADC_G9_RCR9.
* To use register names with standard convension, please use VADC_G9_RCR9.
*/
#define	VADC_G9RCR9	(VADC_G9_RCR9)

/** \\brief  2994, Result Event Flag Clear Register, Group */
#define VADC_G9_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0022994u)

/** Alias (User Manual Name) for VADC_G9_REFCLR.
* To use register names with standard convension, please use VADC_G9_REFCLR.
*/
#define	VADC_G9REFCLR	(VADC_G9_REFCLR)

/** \\brief  2984, Result Event Flag Register, Group */
#define VADC_G9_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0022984u)

/** Alias (User Manual Name) for VADC_G9_REFLAG.
* To use register names with standard convension, please use VADC_G9_REFLAG.
*/
#define	VADC_G9REFLAG	(VADC_G9_REFLAG)

/** \\brief  2B00, Group Result Register */
#define VADC_G9_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B00u)

