HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G9_RES0.
* To use register names with standard convension, please use VADC_G9_RES0.
*/
#define	VADC_G9RES0	(VADC_G9_RES0)

/** \\brief  2B04, Group Result Register */
#define VADC_G9_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B04u)

/** Alias (User Manual Name) for VADC_G9_RES1.
* To use register names with standard convension, please use VADC_G9_RES1.
*/
#define	VADC_G9RES1	(VADC_G9_RES1)

/** \\brief  2B28, Group Result Register */
#define VADC_G9_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B28u)

/** Alias (User Manual Name) for VADC_G9_RES10.
* To use register names with standard convension, please use VADC_G9_RES10.
*/
#define	VADC_G9RES10	(VADC_G9_RES10)

/** \\brief  2B2C, Group Result Register */
#define VADC_G9_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B2Cu)

/** Alias (User Manual Name) for VADC_G9_RES11.
* To use register names with standard convension, please use VADC_G9_RES11.
*/
#define	VADC_G9RES11	(VADC_G9_RES11)

/** \\brief  2B30, Group Result Register */
#define VADC_G9_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B30u)

/** Alias (User Manual Name) for VADC_G9_RES12.
* To use register names with standard convension, please use VADC_G9_RES12.
*/
#define	VADC_G9RES12	(VADC_G9_RES12)

/** \\brief  2B34, Group Result Register */
#define VADC_G9_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B34u)

/** Alias (User Manual Name) for VADC_G9_RES13.
* To use register names with standard convension, please use VADC_G9_RES13.
*/
#define	VADC_G9RES13	(VADC_G9_RES13)

/** \\brief  2B38, Group Result Register */
#define VADC_G9_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B38u)

/** Alias (User Manual Name) for VADC_G9_RES14.
* To use register names with standard convension, please use VADC_G9_RES14.
*/
#define	VADC_G9RES14	(VADC_G9_RES14)

/** \\brief  2B3C, Group Result Register */
#define VADC_G9_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B3Cu)

/** Alias (User Manual Name) for VADC_G9_RES15.
* To use register names with standard convension, please use VADC_G9_RES15.
*/
#define	VADC_G9RES15	(VADC_G9_RES15)

/** \\brief  2B08, Group Result Register */
#define VADC_G9_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B08u)

/** Alias (User Manual Name) for VADC_G9_RES2.
* To use register names with standard convension, please use VADC_G9_RES2.
*/
#define	VADC_G9RES2	(VADC_G9_RES2)

/** \\brief  2B0C, Group Result Register */
#define VADC_G9_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B0Cu)

/** Alias (User Manual Name) for VADC_G9_RES3.
* To use register names with standard convension, please use VADC_G9_RES3.
*/
#define	VADC_G9RES3	(VADC_G9_RES3)

/** \\brief  2B10, Group Result Register */
#define VADC_G9_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B10u)

/** Alias (User Manual Name) for VADC_G9_RES4.
* To use register names with standard convension, please use VADC_G9_RES4.
*/
#define	VADC_G9RES4	(VADC_G9_RES4)

/** \\brief  2B14, Group Result Register */
#define VADC_G9_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B14u)

/** Alias (User Manual Name) for VADC_G9_RES5.
* To use register names with standard convension, please use VADC_G9_RES5.
*/
#define	VADC_G9RES5	(VADC_G9_RES5)

/** \\brief  2B18, Group Result Register */
#define VADC_G9_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B18u)

/** Alias (User Manual Name) for VADC_G9_RES6.
* To use register names with standard convension, please use VADC_G9_RES6.
*/
#define	VADC_G9RES6	(VADC_G9_RES6)

/** \\brief  2B1C, Group Result Register */
#define VADC_G9_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B1Cu)

/** Alias (User Manual Name) for VADC_G9_RES7.
* To use register names with standard convension, please use VADC_G9_RES7.
*/
#define	VADC_G9RES7	(VADC_G9_RES7)

/** \\brief  2B20, Group Result Register */
#define VADC_G9_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B20u)

/** Alias (User Manual Name) for VADC_G9_RES8.
* To use register names with standard convension, please use VADC_G9_RES8.
*/
#define	VADC_G9RES8	(VADC_G9_RES8)

/** \\brief  2B24, Group Result Register */
#define VADC_G9_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022B24u)

/** Alias (User Manual Name) for VADC_G9_RES9.
* To use register names with standard convension, please use VADC_G9_RES9.
*/
#define	VADC_G9RES9	(VADC_G9_RES9)

/** \\brief  2B80, Group Result Reg., Debug */
#define VADC_G9_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B80u)

/** Alias (User Manual Name) for VADC_G9_RESD0.
* To use register names with standard convension, please use VADC_G9_RESD0.
*/
#define	VADC_G9RESD0	(VADC_G9_RESD0)

/** \\brief  2B84, Group Result Reg., Debug */
#define VADC_G9_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B84u)

/** Alias (User Manual Name) for VADC_G9_RESD1.
* To use register names with standard convension, please use VADC_G9_RESD1.
*/
#define	VADC_G9RESD1	(VADC_G9_RESD1)

/** \\brief  2BA8, Group Result Reg., Debug */
#define VADC_G9_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BA8u)

/** Alias (User Manual Name) for VADC_G9_RESD10.
* To use register names with standard convension, please use VADC_G9_RESD10.
*/
#define	VADC_G9RESD10	(VADC_G9_RESD10)

/** \\brief  2BAC, Group Result Reg., Debug */
#define VADC_G9_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BACu)

/** Alias (User Manual Name) for VADC_G9_RESD11.
* To use register names with standard convension, please use VADC_G9_RESD11.
*/
#define	VADC_G9RESD11	(VADC_G9_RESD11)

/** \\brief  2BB0, Group Result Reg., Debug */
#define VADC_G9_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB0u)

/** Alias (User Manual Name) for VADC_G9_RESD12.
* To use register names with standard convension, please use VADC_G9_RESD12.
*/
#define	VADC_G9RESD12	(VADC_G9_RESD12)

/** \\brief  2BB4, Group Result Reg., Debug */
#define VADC_G9_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB4u)

/** Alias (User Manual Name) for VADC_G9_RESD13.
* To use register names with standard convension, please use VADC_G9_RESD13.
*/
#define	VADC_G9RESD13	(VADC_G9_RESD13)

/** \\brief  2BB8, Group Result Reg., Debug */
#define VADC_G9_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB8u)

/** Alias (User Manual Name) for VADC_G9_RESD14.
* To use register names with standard convension, please use VADC_G9_RESD14.
*/
#define	VADC_G9RESD14	(VADC_G9_RESD14)

/** \\brief  2BBC, Group Result Reg., Debug */
#define VADC_G9_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BBCu)

