HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxVadc_reg.h
/** \\brief  8, Module Identification Register */
#define VADC_ID /*lint --e(923)*/ (*(volatile Ifx_VADC_ID*)0xF0020008u)

/** \\brief  34, Kernel Reset Register 0 */
#define VADC_KRST0 /*lint --e(923)*/ (*(volatile Ifx_VADC_KRST0*)0xF0020034u)

/** \\brief  30, Kernel Reset Register 1 */
#define VADC_KRST1 /*lint --e(923)*/ (*(volatile Ifx_VADC_KRST1*)0xF0020030u)

/** \\brief  2C, Kernel Reset Status Clear Register */
#define VADC_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_KRSTCLR*)0xF002002Cu)

/** \\brief  28, OCDS Control and Status Register */
#define VADC_OCS /*lint --e(923)*/ (*(volatile Ifx_VADC_OCS*)0xF0020028u)

/** \\brief  50BC, Calibration Control Register */
#define VADC_SHS0_CALCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALCTR*)0xF00250BCu)

/** \\brief  50C0, Gain Calibration Control Register */
#define VADC_SHS0_CALGC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00250C0u)

/** \\brief  50C4, Gain Calibration Control Register */
#define VADC_SHS0_CALGC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00250C4u)

/** \\brief  50C8, Gain Calibration Control Register */
#define VADC_SHS0_CALGC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00250C8u)

/** \\brief  50CC, Gain Calibration Control Register */
#define VADC_SHS0_CALGC3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00250CCu)

/** \\brief  50E0, Offset Calibration Control Register */
#define VADC_SHS0_CALOC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00250E0u)

/** \\brief  50E4, Offset Calibration Control Register */
#define VADC_SHS0_CALOC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00250E4u)

/** \\brief  50E8, Offset Calibration Control Register */
#define VADC_SHS0_CALOC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00250E8u)

/** \\brief  50EC, Offset Calibration Control Register */
#define VADC_SHS0_CALOC3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00250ECu)

/** \\brief  5008, Module Identification Register */
#define VADC_SHS0_ID /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_ID*)0xF0025008u)

/** \\brief  5040, SHS Configuration Register */
#define VADC_SHS0_SHSCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_SHSCFG*)0xF0025040u)

/** \\brief  5044, Stepper Configuration Register */
#define VADC_SHS0_STEPCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_STEPCFG*)0xF0025044u)

/** \\brief  5080, Timing Configuration Register */
#define VADC_SHS0_TIMCFG0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025080u)

/** \\brief  5084, Timing Configuration Register */
#define VADC_SHS0_TIMCFG1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025084u)

/** \\brief  5088, Timing Configuration Register */
#define VADC_SHS0_TIMCFG2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025088u)

/** \\brief  508C, Timing Configuration Register */
#define VADC_SHS0_TIMCFG3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF002508Cu)

/** \\brief  52BC, Calibration Control Register */
#define VADC_SHS1_CALCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALCTR*)0xF00252BCu)

/** \\brief  52C0, Gain Calibration Control Register */
#define VADC_SHS1_CALGC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00252C0u)

/** \\brief  52C4, Gain Calibration Control Register */
#define VADC_SHS1_CALGC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00252C4u)

/** \\brief  52C8, Gain Calibration Control Register */
#define VADC_SHS1_CALGC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00252C8u)

/** \\brief  52CC, Gain Calibration Control Register */
#define VADC_SHS1_CALGC3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00252CCu)

/** \\brief  52E0, Offset Calibration Control Register */
#define VADC_SHS1_CALOC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00252E0u)

/** \\brief  52E4, Offset Calibration Control Register */
#define VADC_SHS1_CALOC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00252E4u)

/** \\brief  52E8, Offset Calibration Control Register */
#define VADC_SHS1_CALOC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00252E8u)

/** \\brief  52EC, Offset Calibration Control Register */
#define VADC_SHS1_CALOC3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00252ECu)

/** \\brief  5208, Module Identification Register */
#define VADC_SHS1_ID /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_ID*)0xF0025208u)

/** \\brief  5240, SHS Configuration Register */
#define VADC_SHS1_SHSCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_SHSCFG*)0xF0025240u)

/** \\brief  5244, Stepper Configuration Register */
#define VADC_SHS1_STEPCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_STEPCFG*)0xF0025244u)

/** \\brief  5280, Timing Configuration Register */
#define VADC_SHS1_TIMCFG0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025280u)

/** \\brief  5284, Timing Configuration Register */
#define VADC_SHS1_TIMCFG1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025284u)

/** \\brief  5288, Timing Configuration Register */
#define VADC_SHS1_TIMCFG2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025288u)

/** \\brief  528C, Timing Configuration Register */
#define VADC_SHS1_TIMCFG3 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF002528Cu)

/** \\brief  54BC, Calibration Control Register */
#define VADC_SHS2_CALCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS2_CALCTR*)0xF00254BCu)

/** \\brief  54C0, Gain Calibration Control Register */
#define VADC_SHS2_CALGC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00254C0u)

/** \\brief  54C4, Gain Calibration Control Register */
#define VADC_SHS2_CALGC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00254C4u)

/** \\brief  54C8, Gain Calibration Control Register */
#define VADC_SHS2_CALGC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALGC*)0xF00254C8u)

/** \\brief  54E0, Offset Calibration Control Register */
#define VADC_SHS2_CALOC0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00254E0u)

/** \\brief  54E4, Offset Calibration Control Register */
#define VADC_SHS2_CALOC1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00254E4u)

/** \\brief  54E8, Offset Calibration Control Register */
#define VADC_SHS2_CALOC2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_CALOC*)0xF00254E8u)

/** \\brief  5408, Module Identification Register */
#define VADC_SHS2_ID /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS2_ID*)0xF0025408u)

/** \\brief  5440, SHS Configuration Register */
#define VADC_SHS2_SHSCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS2_SHSCFG*)0xF0025440u)

/** \\brief  5444, Stepper Configuration Register */
#define VADC_SHS2_STEPCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS2_STEPCFG*)0xF0025444u)

/** \\brief  5480, Timing Configuration Register */
#define VADC_SHS2_TIMCFG0 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025480u)

/** \\brief  5484, Timing Configuration Register */
#define VADC_SHS2_TIMCFG1 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025484u)

/** \\brief  5488, Timing Configuration Register */
#define VADC_SHS2_TIMCFG2 /*lint --e(923)*/ (*(volatile Ifx_VADC_SHS_TIMCFG*)0xF0025488u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXVADC_REG_H */
